constantAngleSlopeTurbKWUProfileInlet230421GLZ/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;

    turbulence      on;

    printCoeffs     on;

	alphaK1			0.8917835232145943;
	alphaK2			1.000155350023706;
	alphaOmega1			0.49944833473407513;
	alphaOmega2			0.8558490016753333;
	beta1		0.07505396896011127;
	beta2	0.08282311758870778;
	betaStar	0.09006476275213351;
	gamma1	0.5555896614870883;
	gamma2	0.4399787031616651;
	a1	0.31022307170179325;
	b1	0.99929679347715;
	c1	10.007195861348169;
        F3          no;
}


// ************************************************************************* //
